---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BeamHJustification
source: html/dd8d368a-8ab5-6746-431b-2900514baf59.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BeamHJustification Property

"Lateral Justification"

## Syntax (C#)
```csharp
public static ForgeTypeId BeamHJustification { get; }
```